app/controllers/api/v1/apartments_controller.rb

      def create
        Apartment.create!(apartment_params)
---
INSERT INTO "apartments" ("title", "price", "sqm", "total_bedroom", "total_bathroom", "picture", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

      def update
        apartment.update(apartment_params)
---
UPDATE "apartments" SET "title" = $1, "updated_at" = $2 WHERE "apartments"."id" = $3  [["title", "updated by api "], ["updated_at", "2021-04-06 08:33:19.612561"], ["id", 101]]

      def destroy
        @apartment.destroy
---
DELETE FROM "apartments" WHERE "apartments"."id" = $1  [["id", 2391]]

      def set_apartment
        @apartment = Apartment.find(params[:id])
---
SELECT "apartments".* FROM "apartments" WHERE "apartments"."id" = $1 LIMIT $2  [["id", 101], ["LIMIT", 1]]